app/controllers/authors_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]
---
  def show
    @post = Post.find(params[:id])